# Modified YOLOv8 Backbone with LDConv & Pyramid Pooling
backbone:
  - [-1, 1, LDConv, [64, 3, 2]]  
  - [-1, 1, LDConv, [128, 3, 2]]  
  - [-1, 3, C2f_Faster, [128, True]]
  - [-1, 1, LDConv, [256, 3, 2]]  
  - [-1, 6, C2f_Faster, [256, True]]
  - [-1, 1, LDConv, [512, 3, 2]]  
  - [-1, 6, C2f_Faster, [512, True]]
  - [[-1], 1, PyramidPoolAgg, [512, 5]]  

# Feature Aggregation with SimFusion & InjectionMultiSum
head:
  - [-1, 1, LDConv, [256, 1, 1]]  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  
  - [[4], 1, LDConv, [256, 1, 1]]  
  - [[[ -1], [-2]], 1, SimFusion_4in, [[]]]  
  - [-1, 3, C2f_Faster, [256]]  

  - [-1, 1, LDConv, [128, 1, 1]]  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  
  - [[2], 1, LDConv, [128, 1, 1]]  
  - [[[ -1], [-2]], 1, SimFusion_3in, [nc]]  
  - [-1, 3, C2f_Faster, [128]]  

  - [[-1], 1, InjectionMultiSum_Auto_pool, [128]]  
  - [[[ -1], [12]], 1, Concat, [1]]  
  - [-1, 3, C2f_Faster, [256]]  

  - [-1, 1, LDConv, [256, 3, 2]]  
  - [[[ -1], [8]], 1, Concat, [1]]  
  - [-1, 3, C2f_Faster, [512]]  

  # Final Feature Fusion before Detection
  - [[[2], [4], [6]], 1, ScalSeq, [128]]  
  - [[[17], [-1]], 1, AdvPoolFusion, []]  

  # Detection
  - [[[25], [20], [23]], 1, Detect, [nc]]  

