# GoldYOLO-n Configuration
nc: 6 # number of classes
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]  # YOLOv8n summary
  s: [0.33, 0.50, 1024]  # YOLOv8s summary
  m: [0.67, 0.75, 768]   # YOLOv8m summary
  l: [1.00, 1.00, 512]   # YOLOv8l summary
  x: [1.00, 1.25, 512]   # YOLOv8x summary

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],    # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],   # 1-P2/4
   [-1, 6, C2f, [128, True]],    # 2
   [-1, 1, Conv, [256, 3, 2]],   # 3-P3/8
   [-1, 12, C2f, [256, True]],   # 4
   [-1, 1, Conv, [512, 3, 2]],   # 5-P4/16
   [-1, 18, C2f, [512, True]],   # 6
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 6, C2f, [1024, True]],   # 8
   [-1, 1, SPPF, [1024, 5]]]     # 9

head:
  # RepGDNeck structure
  [[-1, 1, SimFusion_4in, []],   # 10: low_FAM
   [-1, 3, Conv, [96, 1, 1]],    # 11: low_IFM start
   [-1, 1, Conv, [96, 1, 1]],    # 12: low_IFM end

   [9, 1, SimConv, [512, 1, 1]], # 13: reduce_layer_c5
   [[4, 6, 13], 1, SimFusion_3in, [256]], # 14: LAF_p4
   [-1, 1, InjectionMultiSum_Auto_pool, [256]], # 15
   [-1, 12, RepBlock, [256]],    # 16: Rep_p4

   [-1, 1, SimConv, [128, 1, 1]], # 17: reduce_layer_p4
   [[2, 4, 17], 1, SimFusion_3in, [128]], # 18: LAF_p3
   [-1, 1, InjectionMultiSum_Auto_pool, [128]], # 19
   [-1, 12, RepBlock, [128]],    # 20: Rep_p3

   [[20, 16, 9], 1, PyramidPoolAgg, [352]], # 21: high_FAM
   [-1, 2, TopBasicLayer, [[128, 64]]], # 22: high_IFM
   [-1, 1, Conv, [192, 1, 1]],   # 23: conv_1x1_n

   [[20, 17], 1, AdvPoolFusion, []], # 24: LAF_n4
   [-1, 1, InjectionMultiSum_Auto_pool, [256]], # 25
   [-1, 12, RepBlock, [256]],    # 26: Rep_n4

   [[26, 13], 1, AdvPoolFusion, []], # 27: LAF_n5
   [-1, 1, InjectionMultiSum_Auto_pool, [512]], # 28
   [-1, 12, RepBlock, [512]],    # 29: Rep_n5

   [[20, 26, 29], 1, Detect, [nc]] # Detect(P3, N4, N5)


