# GoldYOLO-n Configuration
nc: 6 # number of classes
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]  # YOLOv8n summary
  s: [0.33, 0.50, 1024]  # YOLOv8s summary
  m: [0.67, 0.75, 768]   # YOLOv8m summary
  l: [1.00, 1.00, 512]   # YOLOv8l summary
  x: [1.00, 1.25, 512]   # YOLOv8x summary

backbone:
  - [-1, 1, LDConv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, LDConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f_AKConv, [128, True]]
  - [-1, 1, LDConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f_AKConv, [256, True]]
  - [-1, 1, LDConv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f_AKConv, [512, True]]
  - [-1, 1, SPPF, [512, 5]]  # 7
head:
  # RepGDNeck structure
  - [[0, 2, 4, 6], 1, SimFusion_4in, []]   # 10: low_FAM
  - [-1, 3, Conv, [96, 1, 1]]   # 11: low_IFM start
  - [-1, 1, Conv, [96, 1, 1]]   # 12: low_IFM end

  - [9, 1, Conv, [512, 1, 1]] # 13: reduce_layer_c5
  - [[4, 6, 11], 1, SimFusion_3in, [256]] # 14: LAF_p4
  - [[-1, -2], 1, InjectionMultiSum_Auto_pool, [256]] # 15
  - [-1, 12, RepBlock, [256]]    # 16: Rep_p4

  - [-1, 1, Conv, [128, 1, 1]] # 17: reduce_layer_p4
  - [[2, 4, 15], 1, SimFusion_3in, [128]] # 18: LAF_p3
  - [[-1, -2], 1, InjectionMultiSum_Auto_pool, [128]] # 19
  - [-1, 12, RepBlock, [128]]    # 20: Rep_p3

  - [[20, 16, 9], 1, PyramidPoolAgg, [352]] # 21: high_FAM
  - [-1, 2, TopBasicLayer, [[128, 64]]] # 22: high_IFM
  - [-1, 1, Conv, [192, 1, 1]]   # 23: conv_1x1_n

  - [[20, 17], 1, AdvPoolFusion, []] # 24: LAF_n4
  - [-1, 1, InjectionMultiSum_Auto_pool, [256]] # 25
  - [-1, 12, RepBlock, [256]]    # 26: Rep_n4

  - [[26, 13], 1, AdvPoolFusion, []] # 27: LAF_n5
  - [-1, 1, InjectionMultiSum_Auto_pool, [512]] # 28
  - [-1, 12, RepBlock, [512]]    # 29: Rep_n5

  - [[20, 26, 29], 1, Detect, [nc]] # Detect(P3, N4, N5)


