nc: 6
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# EfficientNet-B0 backbone
backbone:
  # P1/2 - Stem
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2 (320x320 -> 160x160)
  
  # P2/4 - Stage 2: MBConv1, k3x3, s1, e1, i32, o16
  - [-1, 1, MBConv, [16, 1, "SiLU", 0.0, 1]] # 1 (160x160 -> 160x160)
  
  # P2/4 - Stage 3: MBConv6, k3x3, s2, e6, i16, o24  
  - [-1, 2, MBConv, [24, 6, "SiLU", 0.0, 2]] # 2-P2/4 (160x160 -> 80x80)
  
  # P3/8 - Stage 4: MBConv6, k5x5, s2, e6, i24, o40
  - [-1, 2, MBConv, [40, 6, "SiLU", 0.0, 2]] # 3-P3/8 (80x80 -> 40x40) **OUTPUT**
  
  # P4/16 - Stage 5: MBConv6, k3x3, s2, e6, i40, o80
  - [-1, 3, MBConv, [80, 6, "SiLU", 0.0, 2]] # 4-P4/16 (40x40 -> 20x20) **OUTPUT**
  
  # Stage 6: MBConv6, k5x5, s1, e6, i80, o112 (no downsampling)
  - [-1, 3, MBConv, [112, 6, "SiLU", 0.0, 1]] # 5 (20x20 -> 20x20)
  
  # P5/32 - Stage 7: MBConv6, k5x5, s2, e6, i112, o192
  - [-1, 4, MBConv, [192, 6,"SiLU", 0.0, 2]] # 6-P5/32 (20x20 -> 10x10) **OUTPUT**
  
  # Stage 8: MBConv6, k3x3, s1, e6, i192, o320 (no downsampling)
  - [-1, 1, MBConv, [320, 6, "SiLU", 0.0, 1]] # 7 (10x10 -> 10x10)
  
  # Final conv + SPPF
  - [-1, 1, Conv, [1280, 1, 1]] # 8 (10x10 -> 10x10)
  - [-1, 1, SPPF, [1280, 5]] # 9-P5/32 (10x10 -> 10x10)

head:
  # First upsampling branch: P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 (10x10 -> 20x20)
  - [[-1, 4], 1, Concat, [1]] # 11 - cat P4 from backbone (both 20x20)
  - [-1, 3, C2f, [512]] # 12 (20x20)

  # Second upsampling branch: P4 -> P3  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 (20x20 -> 40x40)
  - [[-1, 3], 1, Concat, [1]] # 14 - cat P3 from backbone (both 40x40)
  - [-1, 3, C2f, [256]] # 15-P3/8 (40x40)

  # First downsampling branch: P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]] # 16 (40x40 -> 20x20)
  - [[-1, 12], 1, Concat, [1]] # 17 - cat P4 from head (both 20x20)
  - [-1, 3, C2f, [512]] # 18-P4/16 (20x20)

  # Second downsampling branch: P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]] # 19 (20x20 -> 10x10)
  - [[-1, 9], 1, Concat, [1]] # 20 - cat P5 from backbone (both 10x10)
  - [-1, 3, C2f, [1024]] # 21-P5/32 (10x10)

  # Detection head
  - [[15, 18, 21], 1, Detect, [nc]] # 22 - Detect(P3, P4, P5))

