# Ultralytics YOLO 🚀, AGPL-3.0 license
# Modified YOLOv8 with Dynamic Snake Convolution (DSConv)

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary
  s: [0.33, 0.50, 1024]  # YOLOv8s summary
  m: [0.67, 0.75, 768]   # YOLOv8m summary
  l: [1.00, 1.00, 512]   # YOLOv8l summary
  x: [1.00, 1.25, 512]   # YOLOv8x summary

# Modified YOLOv8.0n backbone 
backbone:
  - [-1, 1, LDConv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, LDConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f_Faster, [128, True]]
  - [-1, 1, LDConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f_Faster, [256, True]]
  - [-1, 1, LDConv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f_Faster, [512, True]]
  - [-1, 1, SPPF, [512, 5]]  # 7

# Modified head with DSConv
head:
  - [-1, 1, DySnakeConv, [256, 1]]  # 8 (channels reduced)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [4, 1, DySnakeConv, [256, 1]]  # 10 (channels reduced)
  - [[-1, -2], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [256]]

  - [-1, 1, DySnakeConv, [128, 1]]  # 13
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [2, 1, DySnakeConv, [128, 1]]  # 15
  - [[-1, -2], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [128]]  # 17 (P2/4-small)

  - [-1, 1, DySnakeConv, [128, 3]]  # 18
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [256]]  # 20 (P3/8-medium)

  - [-1, 1, DySnakeConv, [256, 3]]  # 21
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [512]]  # 23 (P4/16-large)

  # Detection
  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P2, P3, P4)