# Ultralytics YOLO 🚀, AGPL-3.0 license
# Modified YOLOv8 object detection model with P2-P4 outputs

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]  # YOLOv8n summary
  s: [0.33, 0.50, 1024]  # YOLOv8s summary
  m: [0.67, 0.75, 768]   # YOLOv8m summary
  l: [1.00, 1.00, 512]   # YOLOv8l summary
  x: [1.00, 1.25, 512]   # YOLOv8x summary

# Modified YOLOv8.0n backbone
backbone:
  - [-1, 1, LDConv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, LDConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, RepBlock, [128, True]]
  - [-1, 1, LDConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, RepBlock, [256, True]]
  - [-1, 1, LDConv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, Repblock, [512, True]]
  - [-1, 1, SPPF, [512, 5]]  # 7

# Modified head
head:
  # Downscaling path
  - [[2, 4, 6, 7], 1, SimFusion_4in, []]   # 8: low_FAM
  - [-1, 1, LDConv, [256, 1, 1]]  # 9
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [4, 1, LDConv, [256, 1, 1]]  # 11
  - [[-1, -2], 1, Concat, [1]]  # 12
  - [-1, 3, Repblock, [256]]  # 13

  - [-1, 1, LDConv, [128, 1, 1]]  # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [2, 1, LDConv, [128, 1, 1]]  # 16
  - [[-1, -2], 1, Concat, [1]]  # 17
  - [-1, 3, Repblock, [128]]  # 18 (P2/4-small)

  # Upscaling path
  - [-1, 1, LDConv, [128, 3, 2]]  # 19
  - [[-1, 13], 1, Concat, [1]]  # 20
  - [-1, 3, Repblock, [256]]  # 21 (P3/8-medium)

  - [-1, 1, LDConv, [256, 3, 2]]  # 22
  - [[-1, 9], 1, Concat, [1]]  # 23
  - [-1, 3, Repblock, [512]]  # 24 (P4/16-large)

  # ScalSeq and detection
  - [[2, 4, 6], 1, ScalSeq, [128]]  # 25
  - [[18, -1], 1, Add, []]  # 26  

  - [[26, 21, 24], 1, Detect, [nc]]  # Detector(P2, P3, P4)


