# Modified YOLOv8 Backbone with LDConv & Pyramid Pooling
backbone:
  # [from, number, module, args]
  - [-1, 1, LDConv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, LDConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f_Faster, [128, True]]  # 2
  - [-1, 1, LDConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f_Faster, [256, True]]  # 4
  - [-1, 1, LDConv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f_Faster, [512, True]]  # 6
  - [[-1], 1, PyramidPoolAgg, [512, 5]]  # 7

# Feature Aggregation with SimFusion & InjectionMultiSum
head:
  - [-1, 1, LDConv, [256, 1, 1]]  # 8
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 9
  - [4, 1, LDConv, [256, 1, 1]]  # 10
  - [[-1, -2], 1, SimFusion_4in, []]  # 11 (removed nested list)
  - [-1, 3, C2f_Faster, [256]]  # 12

  - [-1, 1, LDConv, [128, 1, 1]]  # 13
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [2, 1, LDConv, [128, 1, 1]]  # 15
  - [[-1, -2], 1, SimFusion_3in, [nc]]  # 16
  - [-1, 3, C2f_Faster, [128]]  # 17

  - [-1, 1, InjectionMultiSum_Auto_pool, [128]]  # 18
  - [[-1, 12], 1, Concat, [1]]  # 19
  - [-1, 3, C2f_Faster, [256]]  # 20

  - [-1, 1, LDConv, [256, 3, 2]]  # 21
  - [[-1, 8], 1, Concat, [1]]  # 22
  - [-1, 3, C2f_Faster, [512]]  # 23

  # Final Feature Fusion before Detection
  - [[2, 4, 6], 1, ScalSeq, [128]]  # 24
  - [[[17], [-1]], 1, AdvPoolFusion, []]  # 25

  # Detection
  - [[[25], [20], [23]], 1, Detect, [nc]]  # 26
